[
{"headline": ["EURUSD follows the pound higher", "The major indices open with mixed results ", "USDJPY ping-pongs between 100/200 hour MA", "GBPUSD moves above the 100 hour MA", "The NZD is the strongest and the CHF is the weakest as NA traders enter for the day", "Gold has stuck to the seasonal script so far in December but further gains may have to wait", "Dollar keeps softer so far in European morning trade", "NASDAQ and Russell 2000 close at record highs", "EURJPY continues to waffle", "WTI crude oil futures settle at $47.02", "USDCHF trades to new session highs", "Gold down on day and remains below 100 day MA", "EURUSD hits the skids and falls below the 200 hour MA now.", "European shares recover from yesterday's tumble", "USDJPY tests 200 hour MA and backs off", "GBPUSD moves to a new session low", "US stocks open higher but rotate lower in early trading", "AUDUSD rotates lower after volatile down and up session yesterday", "Down and up day for the EURUSD. Near unchanged.  ", "The CHF is the strongest and the NZD is the weakest as NA traders enter for the day", "Sterling a little all over the place on Brexit headlines", "Broad indices close lower but well off the worst levels of the day", "Crude oil futures settle at $47.74", "Meanwhile....The EURUSD has returned to unchanged on the day", "GBPUSD spikes higher on PM Johnson Brexit comments"], "date": [1608735156.0, 1608734099.0, 1608733400.0, 1608732325.0, 1608729782.0, 1608716140.0, 1608710168.0, 1608671234.0, 1608670556.0, 1608665902.0, 1608663426.0, 1608660111.0, 1608656082.0, 1608655537.0, 1608652822.0, 1608650813.0, 1608647856.0, 1608647687.0, 1608645775.0, 1608643389.0, 1608635720.0, 1608585038.0, 1608581821.0, 1608580889.0, 1608578990.0]},
{"headline": ["S&P/Nasdaq continue rebound. Dow higher on the day", "AUDUSD breaks 200 hour MA and moves to next target", "GBPUSD bounces to 38.2% retracement. Still off highs and close from Friday ", "USDCAD tests a swing area as the price corrects the sharp earlier gains", "EURUSD works toward retracing the full decline", "Maj. European indices end the day with sharp declines", "USDJPY trades between hourly MAs after run higher today fails on the break", "Stock decline picks up steam", "AUDUSD corrects back toward 200 hour MA", "Major US indices open lower but rebounding in early trading", "GBPUSD bounces. Moves back above a swing area as it retraces", "EURUSD bounces in early NY trading", "The USD is the strongest and the GBP is the weakest as NA traders enter for the day", "Dollar continues to go from strength to strength so far on the session", "EUR/GBP looks towards the month's high, buyers capitalising on pound woes", "AUD/USD drops by more than 1% on the day as dollar pullback gathers pace", "Cable extends fall to 1.3300 to start the session", "Stocks close lower after setting intraday highs", "WTI crude oil futures settle at $49.10", "NZDUSD chops near day lows.  Support stalls the fall today.", "USDCAD returns to the highs for the week", "German DAX a big winner this week, but closes lower today", "USDCHF bounces toward its 200 hour MA ", "GBPUSD dips to new session lows and tests its 100 hour moving average", "USDJPY corrects up to the 100 hour moving average today and finds sellers"], "date": [1608577738.0, 1608574721.0, 1608573442.0, 1608571659.0, 1608570392.0, 1608568976.0, 1608565199.0, 1608563551.0, 1608562694.0, 1608561525.0, 1608561363.0, 1608558450.0, 1608556603.0, 1608543916.0, 1608541866.0, 1608536946.0, 1608536190.0, 1608326079.0, 1608320618.0, 1608316892.0, 1608312582.0, 1608309425.0, 1608306917.0, 1608305546.0, 1608304191.0]},
{"headline": ["GBPUSD corrects to the 38.2% of the range this week", "EURUSD modest correction lower today. Close support holds.", "The CHF is the strongest and the GBP is the weakest as NA traders enter for the day", "Pound falls to fresh lows for the day, Brexit agreement remains elusive", "Dollar a touch firmer, risk keeps more tepid so far on the session", "NASDAQ and S&P close at record highs", "AUDUSD runs toward the next target area.  Highest level since June 2018", "WTI crude oil futures settle at $48.36", "USDCAD rebounds back toward the 100 hour MA again after bounce of double bottom", "GBPUSD keeps the buyers in control.  Can it get above high now?", "European indices close off highs/mixed", "The EURJPY is coiling.  Traders await the next shove.", "Gold continues its move higher. Up around $75 for the week", "GBPUSD finds sellers near the next upside target. Modest dip.", "Major indices open with gains. ", "USDJPY breaks below recent swing lows", "EURUSD continues the run higher.  A look at the short, intermediate and long charts.", "The NZD is the strongest and the USD is the weakest as NA traders enter for the day", "The pound continues to thrive on Brexit deal hopes", "Gold climbs to fresh one-month high as the dollar is seen softer across the board", "AUD/USD extends gains to highest levels since June 2018 as the dollar falters", "Dollar trails behind to kick start the session", "Mixed ending for the major US indices today", "USDCHF back down testing the recent floor", "EURUSD moves back to test the old ceiling (that was earlier broken today). "], "date": [1608302581.0, 1608300066.0, 1608297151.0, 1608284434.0, 1608280494.0, 1608239584.0, 1608237814.0, 1608234068.0, 1608233176.0, 1608227176.0, 1608224666.0, 1608221073.0, 1608218417.0, 1608217639.0, 1608216103.0, 1608215703.0, 1608214649.0, 1608210813.0, 1608205609.0, 1608194766.0, 1608193560.0, 1608189992.0, 1608153184.0, 1608151904.0, 1608149969.0]},
{"headline": ["USDJPY spikes higher, and reverses lower", "Stocks reverse and trades to new session highs", "Stocks dip after FOMC decision", "The US dollar has moved higher after the FOMC decision", "Key levels for some of the major pairs through the FOMC", "USDCHF knocks again on the 100 hour MA door", "Sellers in the EURUSD take pair back below the old December ceiling", "German DAX leads the charge higher in Europe", "NZDUSD retraces gains and trades to new session lows", "USDJPY bounces to old floor on the hourly chart. Sellers lean.", "GBPUSD break to new year highs (and trades to highest level since May 2018), runs into sellers", "Major indices open modestly higher in the US", "EURUSD rotate back down toward the old December ceiling", "USDCHF off lows after being labeled a currency manipulator. What are the charts saying?", "The GBPUSD is the strongest and the CAD is the weakest as NA traders enter for the day", "USD/JPY nears November lows on dollar struggles", "Dollar keeps softer as risk stays more upbeat so far on the session", "EUR/USD powers to fresh highs since April 2018 on French, German PMI beats", "Dollar holds a touch weaker to start the session", "WTI crude oil futures settle at $47.62", "Stocks trade to new session highs", "Gold moves back toward highs for the day. Up over 1.4% on the day.", "USDCAD trades to a new 2020 low", "USD/CAD falls to fresh low since 2018 as risk trades rip", "German DAX closes near highs for the day"], "date": [1608149268.0, 1608147647.0, 1608146726.0, 1608146214.0, 1608144966.0, 1608139791.0, 1608138435.0, 1608136998.0, 1608134905.0, 1608133053.0, 1608130577.0, 1608129169.0, 1608128678.0, 1608128116.0, 1608124507.0, 1608114809.0, 1608111858.0, 1608108187.0, 1608104269.0, 1608061183.0, 1608060692.0, 1608058240.0, 1608056383.0, 1608056141.0, 1608050194.0]},
{"headline": ["EURGBP falls to new lows as Brexit deal hopes increase", "USDCHF traders look for the next shove", "AUDUSD holds near 100 hour MA on test.... bounces", "USDCAD finds sellers against the 100 hour MA today after string of failures", "Major indices open up with solid gains", "USDJPY tests swing low extremes after sellers near MAs stalled the rally", "GBPUSD trades back higher and above 200 hour MA", "EURUSD dips to new session low in early NA trading, and bounces", "Gold climbs to six-day high as US dollar softens", "Mixed results in the US stock market today", "NZDUSD has an up and down day ", "WTI crude oil futures settle at $46.99 in an up and down session", "Gold down but stays above 200 day MA", "Some hefty EURUSD options this week", "AUDUSD retests underside of broken trend line", "USDCAD back above the 100 hour MA.  Can it stay above now?", "European shares and mostly higher. UK's FTSE 100 modestly lower", "EURUSD retests MA support and bounces (again).", "USDJPY completes down and up trading lap today", "USDCHF squeaks out another new swing low going back to January 2015...", "USDCAD tests lows from last week and bounces", "EURUSD tests December high. Backs off.", "GBPUSD trades in the meat of the trading range", "The GBP is the strongest and the USD is the weakest to start the trading week ", "Disney boosts Dow into positive territory. The NASDAQ and S&P close lower"], "date": [1608049645.0, 1608047449.0, 1608045324.0, 1608044569.0, 1608042966.0, 1608042685.0, 1608041311.0, 1608040420.0, 1608040245.0, 1607980123.0, 1607977786.0, 1607974601.0, 1607971316.0, 1607969592.0, 1607967003.0, 1607965381.0, 1607964735.0, 1607963555.0, 1607961366.0, 1607959630.0, 1607958121.0, 1607955817.0, 1607954743.0, 1607952165.0, 1607720922.0]},
{"headline": ["The AUD is the strongest for the week, while the GBP is the weakest", "CFTC commitments of traders: EUR longs increased. GBP position switches from short to long", "WTI crude oil futures settle at $46.57", "NASDAQ index tests its 100 hour moving average", "European shares end the week on a sour note", "AUDUSD trend move higher stalls. Here are some of the  clues", "USDCHF tries price action above 100 hour MA again.  Can it be successful this time?", "USDJPY falls to new session low", "USDCAD tests 100 hour MA/trend line and backs off", "US major indices open lower led by the NASDAQ composite index", "EURUSD holding above 100/200 hour MAs", "GBPUSD continues its decline on Brexit deal concerns, but finding some buyers", "UK PM Johnson: Talks are deadlocked", "US PPI, Michigan sentiment, Baker Hughes rig count on the docket ", "The JPY is the strongest and the GBP is the weakest as NA traders enter for the day", "EUR/GBP breaks to fresh high since late September on Brexit jitters", "Pound slips as Brexit hopes hang in the balance ahead of the weekend", "Dollar regains some ground to start the session", "US stocks end the session with mixed results. NASDAQ rebounds", "AUDUSD and NZDUSD continue run higher", "Crude oil futures settle at $46.78", "AirBnb opens at $146", "Another new low going back to 2015 for USDCHF but fall stalls at trend line on hourly chart", "USDJPY defines support and resistance in up and down session", "European shares closed mixed. German DAX down, UK's FTSE 100 up"], "date": [1607720089.0, 1607718903.0, 1607715827.0, 1607708183.0, 1607705469.0, 1607702973.0, 1607701787.0, 1607700532.0, 1607699979.0, 1607697378.0, 1607697259.0, 1607696254.0, 1607694628.0, 1607693246.0, 1607692993.0, 1607676482.0, 1607675024.0, 1607673320.0, 1607634901.0, 1607633791.0, 1607629222.0, 1607625701.0, 1607624444.0, 1607619693.0, 1607618393.0]},
{"headline": ["S&P index turns positive, but still lags the NASDAQ index. ", "USDCAD extend below the April 2018 low at 1.2527", "AUDUSD extends to highest level since mid June 2018", "EURUSD pushes to to a new session highs. Looks toward the swing highs from the week", "Brent crude oil futures hit $50 a barrel for the 1st time since March", "Major indices open lower. NASDAQ the weakest", "Watching the 1.3283 to 1.32912 area in the GBPUSD for bias clues", "USDCAD moves toward April 2018 lows, and bounces.", "US stocks are moving back lower in premarket trading", "EURUSD moves back above 100 hour MA at 1.21143", "Pound falls further on the day amid ongoing Brexit angst", "Gold slightly lower as the recovery momentum pauses", "Sterling keeps lower to start the session, Brexit can kicked down the road again", "Five parabolic chart moves to watch", "NASDAQ has its worst day since October 30", "AUDUSD retraces most of the gain but finds support near MA/trend line", "US crude oil futures settle at $45.52", "Stock decline accelerating. NASDAQ down over 200 points", "Gold has taken another step lower. Trades down near 2% on the day", "USDCHF moves above its 100 hour moving average for the 1st time since December 1", "NASDAQ index down over  100 points", "USD moves higher as stocks falter", "Major European indices close mixed for the 2nd consecutive day", "USDCAD test 100 hour moving average and backs off", "EURUSD falls below short-term floor support and test 38.2% retracement target"], "date": [1607615734.0, 1607615427.0, 1607613823.0, 1607612349.0, 1607611373.0, 1607610706.0, 1607610476.0, 1607609543.0, 1607608553.0, 1607608188.0, 1607601666.0, 1607591827.0, 1607586820.0, 1607574125.0, 1607548041.0, 1607547031.0, 1607542913.0, 1607539345.0, 1607538605.0, 1607536391.0, 1607535750.0, 1607534856.0, 1607532397.0, 1607531514.0, 1607529500.0]},
{"headline": ["Crude oil futures fall below its 200 hour moving average after surge in inventories", "Gold tilting to the downside. Down around $17", "Major indices open up mixed. NASDAQ lags after record closes this week", "EURUSD below 100 hour MA but above support.  Battle lines are drawn by buyers and sellers", "GBPUSD moves up to retest September 1 high. Backs off on the first look.", "The AUD is the strongest and the CHF is the weakest as NA traders enter for the day", "Sterling claws its way higher ahead of eagerly awaited Johnson-von der Leyen meeting ", "AUD/USD climbs to highest levels since July 2018 on the more positive risk mood", "Gold falls through Tuesday's lows in $13 decline", "NASDAQ/S&P close at record highs", "EURJPY traders pause the recent rally, but under the 100 hour MA", "WTI crude oil futures settle at $45.60", "USDCAD ticks to a new session high", "S&P index moves above 3700 to a new all time high", "NASDAQ turns positive on the day. New all time high reached.", "European major indices erase most of the earlier declines", "USDCAD trades to a session high, but buyers still have more prove", "USDCHF keeps the bearish bias technically. EURCHF tests its 100 day MA on the downside.", "US major indices open lower but off premarket low levels", "USDJPY stays below MA levels. Narrow trading range.", "EURUSD waffles in a narrow trading range", "The GBPUSD spikes higher on EU-UK deal in principle but runs into MA resistance", "The CHF is the strongest while the GBP is the weakest as NA traders enter for the day", "Sterling eases to start the session as Brexit saga drags on into the week", "Gold extends gains to fresh two-week high. What's next"], "date": [1607529066.0, 1607525140.0, 1607524721.0, 1607524481.0, 1607523155.0, 1607520165.0, 1607507988.0, 1607504077.0, 1607487508.0, 1607461545.0, 1607459321.0, 1607456342.0, 1607452645.0, 1607449873.0, 1607447228.0, 1607446013.0, 1607442868.0, 1607439552.0, 1607438051.0, 1607437690.0, 1607436906.0, 1607435714.0, 1607433041.0, 1607415869.0, 1607398201.0]},
{"headline": ["Dow closes lower for the 1st time in 5 days. NASDAQ record close", "GBPUSD rises toward 100 hour MA/upper swing area", "US crude oil futures settle at $45.76", "USDJPY completes the up and down lap", "GBPUSD moves up toward 200 hour moving average/50% retracement", "European major indices end  the day mostly lower. UK FTSE 100 as a small gain", "AUDUSD retraces declines and retests last week highs", "EURUSD tests swing area from the daily chart going back to 2018", "Gold trades to new session highs. Up $15 on the day", "USDCHF takes out last week's low. ", "Major indices open mixed in the US. Dow 4-day win streak in jeopardy", "US stocks set to open mixed", "EURUSD trades corrects to the 38.2% of last week's range and bounces", "GBPUSD rebounds back above 1.3300", "The CHF is the strongest and the GBP is the weakest as NA traders enter for the day", "Dollar keeps firmer on the softer risk mood today", "Pound sinks as Brexit mood music sours", "Cable revisits key near-term levels as Brexit breakthrough appears to still be elusive for now", "US major indices close at record highs led by the S&P index", "EURUSD trades to a new day low", "GBPUSD cracks below retracement support", "WTI crude oil futures settle at $46.26", "USDCAD reaches in the next downside target at the October 2018 low", "NZDUSD has the 200 hour MA rising toward the price", "The NASDAQ index has now joined the S&P and Dow in reaching new all time"], "date": [1607375511.0, 1607371856.0, 1607370366.0, 1607368714.0, 1607364743.0, 1607359355.0, 1607358694.0, 1607357076.0, 1607353153.0, 1607352646.0, 1607351559.0, 1607351214.0, 1607350469.0, 1607349198.0, 1607346415.0, 1607333326.0, 1607329387.0, 1607326223.0, 1607116924.0, 1607115533.0, 1607112198.0, 1607110887.0, 1607106600.0, 1607104626.0, 1607097338.0]},
{"headline": ["USDCAD moves toward October 2018 swing low", "Dow Jones and S&P reach all time new highs\n", "All eyes on bonds: US 30-year bond yields near the June/Nov double top", "AUDUSD rebounds off support after jobs report dip", "US major indices shrug off the weaker jobs data. Open modestly higher", "GBPUSD moves above the 2019 swing high at 1.35139 area", "USDJPY bounces higher and toward the targets in the middle of the range", "EURUSD falls to new session low after jobs report", "The CHF is the strongest and the NZD is the weakest as NA traders await jobs data", "Cable back near unchanged levels after slight Brexit pop earlier", "EUR/USD not resting on its laurels even as the dollar keeps somewhat steadier so far today", "Cable sits a little lower on the session, Brexit still the main focus", "Cable slows down ahead of 1.35 but dips continue to be bough", "European shares end the day with mixed results", "GBPUSD tests 1.3500 level. Highest level since December 2019", "US dollar continues to tumble", "S&P/NASDAQ indices reach a new all-time highs", "AUDUSD trades to new 2020 highs", "USDJPY tests Monday's lows", "US stocks trade marginally higher in early trading", "The GBPUSD pushes toward 2020 high", "EUR/USD breakout continues to be a technician's dream", "EURUSD continues break higher and reaches the next key target", "The GBP is the strongest and the USD is the weakest as NA traders enter for the day", "Cable nears the week's highs as buyers hold on to Brexit deal hopes"], "date": [1607096819.0, 1607095539.0, 1607095185.0, 1607094168.0, 1607092472.0, 1607092042.0, 1607091556.0, 1607090430.0, 1607087375.0, 1607079768.0, 1607073437.0, 1607073133.0, 1607017329.0, 1607013699.0, 1607011413.0, 1607009887.0, 1607009018.0, 1607008181.0, 1607006906.0, 1607006299.0, 1607004870.0, 1607004598.0, 1607003591.0, 1607001197.0, 1606995250.0]},
{"headline": ["Dollar recoups some ground, equities slightly softer on the session so far", "Dollar slips a little further to start the session", "Cable inches back above 1.3400, awaiting further Brexit clues", "AUDUSD retests the week's highs and finds resistance sellers", "WTI crude oil futures settle at $45.28", "USDCAD scrapes along bottoms and lowest levels since October 2018", "AUD/USD near the September high as US dollar selling resumes", "GBPUSD bounces off support/the floor. Back above the 200/100 hour MAs", "EURUSD sees some selling after failed break", "European major indices close the day with mixed results. UK FTSE 100 rises", "AUDUSD trades in a choppy range.  Support at 200 hour MA stalls the fall.", "Oil makes a move after retest of the range, positive rumblings on OPEC+", "USDJPY retraces lower after double top on the hourly chart stalls the rally", "New highs for the EURUSD", "NZDUSD tests 100 hour MA/old trend line at 0.7031 area", "US stocks open lower with the NASDAQ leading the way", "USDCHF trades to lowest level since January 2015", "GBPUSD moves down to test the \"main floor\" going back to November 23.", "EURUSD bounces off broken trend line", "The CHF is the strongest and the GBP is the weakest as NA traders enter for the day", "Cable falls to fresh session lows on Brexit angst", "Gold extends rebound to $1,830 as buyers seize back near-term control", "Dollar slightly firmer in European morning trade so far", "Pound falls as Brexit deal reportedly hangs in the balance", "Major indices close higher but come off highs in the last hour or so of trading"], "date": [1606988560.0, 1606983185.0, 1606980442.0, 1606939854.0, 1606937774.0, 1606936718.0, 1606934470.0, 1606931349.0, 1606929707.0, 1606927807.0, 1606926638.0, 1606925810.0, 1606924308.0, 1606922331.0, 1606920925.0, 1606919693.0, 1606919388.0, 1606918063.0, 1606916882.0, 1606914404.0, 1606911920.0, 1606906260.0, 1606901105.0, 1606896875.0, 1606856764.0]},
{"headline": ["EURUSD trades to a new session high", "EUR/USD is a classic breakout", "WTI crude oil futures settle at $44.55", "AUDUSD spends most of the day between hourly MA in up and down session", "Gold moves back above its 200 day moving average", "USDCAD tests the day's low", "NASDAQ trades to new session highs", "European shares rebound after yesterdays declines", "GBPUSD has liftoff.  Trades through 1.3400", "USDCHF test 0.9000 level and technical trend line support on the hourly chart", "EURUSD extends to a new 2020 high. Guess what it is?", "USDJPY extends to new session highs. JPY crosses also moving higher", "US construction spending for October 1.3% vs. 0.8% estimate", "Major US indices open higher with the Dow industrial average leading the way", "The NZDUSD moves closer to the highs from yesterday and the June 2018", "Gold extends rebound to 2% in quick turn", "GBPUSD failed break, sends the pair back into the meat of the up and down range", "EURUSD closed yesterday at the low, reversed and rallied back higher today", "The CHF is the strongest and the JPY is the weakest as NA traders enter for the day", "Cable eases back to key near-term levels on pullback after testing 1.3400", "No reprieve for the dollar to start the new month", "EUR/USD buyers looking for another shot at 1.2000", "Cable inches towards key resistance near 1.3400 as dollar keeps softer to start the day", "Dow had its best month since 1987 but closed lower today. Record highs and record closes for the major indices in November", "CFTC Commitments of Traders: Yen longs increased. EUR longs remain the largest "], "date": [1606855713.0, 1606855287.0, 1606851849.0, 1606851459.0, 1606850351.0, 1606845450.0, 1606842858.0, 1606841269.0, 1606839989.0, 1606838705.0, 1606837509.0, 1606836303.0, 1606834808.0, 1606833473.0, 1606833122.0, 1606832031.0, 1606831406.0, 1606830206.0, 1606828159.0, 1606819226.0, 1606814783.0, 1606811268.0, 1606807670.0, 1606770800.0, 1606769224.0]},
{"headline": ["EURJPY runs into October/November highs and backs off", "Crude oil futures settle at $45.34", "AUDUSD tests Friday's low", "USDCAD runs back to the highs after OPEC+ headline news", "European shares end the session lower to start the trading week. Sharp gains for major indices this month.", "EURUSD falls into - and after - the London fix", "USDJPY chops into the London fix at the top of the hour", "USDCAD tests lower trend line and November low", "US stock indices open lower", "GBPUSD trades to new session highs and looks toward November highs", "EURUSD moves closer to 2020 high (and 1.2000 level)", "The CAD is the strongest and the AUD is the weakest as NA traders enter for the day", "EUR/USD on approach to 1.2000, Deutsche sees the pair making a sustained break before year-end", "Pound a little higher but price action still confined by key near-term levels", "Oil a little pressured ahead of OPEC ministerial meeting later today", "US crude oil futures settle at $45.53", "USDJPY lower on the day. Below the 200 hour MA and trend line resistance.  ", "GBPUSD falls below its 200 hour moving average and swing level", "European shares close higher.  Have gains for the week. ", "EURGBP moves back above 200 day MA", "AUDUSD and NZDUSD trade to new highs", "EURUSD tests the high from yesterday ", "Gold tumbles below the $1800 level", "GBPUSD downside off of moving average technical support", "The NZD is the strongest and the GBP is the weakest as NA traders enter for the day"], "date": [1606767831.0, 1606764955.0, 1606759844.0, 1606757822.0, 1606754733.0, 1606752987.0, 1606751833.0, 1606748622.0, 1606747379.0, 1606745732.0, 1606745057.0, 1606742530.0, 1606725810.0, 1606724708.0, 1606718215.0, 1606502681.0, 1606499663.0, 1606498550.0, 1606497137.0, 1606495195.0, 1606490495.0, 1606487088.0, 1606485839.0, 1606485553.0, 1606482148.0]},
{"headline": ["Gold still searching for answers as we look towards the end of the week", "Cable falls to session lows as sellers wrestle back near-term control", "Bitcoin's 12% drop leaves it in a technical vacuum but there's reason for optimism", "Crude gives back the latest pop", "US stocks remain mixed.  European shares also end the session mixed", "NZDUSD retests high for the week", "USDCAD trades between swing area in choppy trading today", "USDJPY moves back toward MA levels", "Major indices open with mixed results", "The GBPUSD finds support buyers near the 100 hour MA", "EURUSD chops around after run to the highest high since Sept 1 fizzles", "The NZD is the strongest and the AUD is the weakest as NA traders enter for the day", "EUR/USD inches to near three-month high as dollar eases a little on the session", "Dollar in a mixed spot to start the session", "Dow and S&P close at record highs.  Dow 30,000.", "USDCAD trades to a new session low", "EURJPY continues the run higher and back above 100 day MA", "WTI crude oil futures settle at $44.91", "AUD/USD: Maintains a bull-wedge targeting 0.7450 - Credit Suisse", "NZDUSD trades the highest level since June 2018", "Major European indices closed sharply higher on risk-on flows", "Dow reaches the 30,000 milestone", "GBPUSD bounces off 100 hour MA/38.2% retracement.  Works toward high for the day (and key swing level).", "USDCAD in the midst of volatile up and down market", "Dow reaches a record high.  30K the next stop."], "date": [1606477499.0, 1606473460.0, 1606417227.0, 1606334156.0, 1606325804.0, 1606322126.0, 1606319837.0, 1606318505.0, 1606315104.0, 1606314885.0, 1606313496.0, 1606309260.0, 1606292425.0, 1606290841.0, 1606251903.0, 1606250302.0, 1606248962.0, 1606247200.0, 1606245694.0, 1606238329.0, 1606237114.0, 1606235122.0, 1606234216.0, 1606232592.0, 1606231164.0]},
{"headline": ["Major US indices open higher. The flow continues to favor the Dow", "USDJPY moves to new session highs", "WTI crude oil breaks the August high", "The GBPUSD backs down toward unchanged after run higher stalls", "The EURUSD runs up to last week's high and backs off to the 100 hour MA", "The NZD is the strongest and the CHF is the weakest as NA traders enter for the day", "Gold slips by 1% on the day as $1,800 draws closer", "AUD/JPY still a key pair to watch in confirming any major shift in the risk bias", "Dollar reverses its moves from overnight trading, what's next?", "AUD/USD climbs to near three-month high as dollar sags to start the session", "How much lower can gold run after the downside break yesterday?", "EURUSD moves back toward swing area", "Crude oil futures settle at $43.06", "EURGBP tests swing area/retracement and bounces", "EURJPY looks to extends above 200 hour MA", "NZDUSD rebounds after testing 200 hour MA", "GBPUSD erases all it's gains", "USDJPY cracks the 200 hour MA now", "AUDUSD falls below the 100/200 hour MA. Seller back in control below 0.7300.", "NASDAQ index gives up gains as traders pivot out of tech", "USDCAD moves toward unchanged", "EURUSD falls with dollars rise and moves back below the 100 hour moving average", "Gold breaks below the key $1850 support zone", "USDJPY moves higher after Markit manufacturing data", "Major indices rebound after Friday's declines"], "date": [1606228315.0, 1606227412.0, 1606226777.0, 1606226567.0, 1606225717.0, 1606223534.0, 1606215202.0, 1606210102.0, 1606207197.0, 1606205990.0, 1606202363.0, 1606165220.0, 1606161764.0, 1606160619.0, 1606158589.0, 1606153600.0, 1606151929.0, 1606147616.0, 1606146734.0, 1606145267.0, 1606144797.0, 1606143960.0, 1606143512.0, 1606143114.0, 1606142229.0]},
{"headline": ["EURUSD tries to extend above swing area resistance", "GBPUSD runs toward 1.3400. Highest level since September 2", "The GBP is the strongest and the USD is weakest as the NA session begins", "EUR/USD touches 1.1900 as dollar eases lower on the session", "The pound continues to lead the charge on the session", "Cable extends gains to start the session as pound keeps more perky", "Oil climbs for the third week in a row, nears the range-top", "NZD was the top performer this week, nears 2019 highs", "EURUSD trades to new lows into the London fix", "USDCAD trades near lows in what has been a choppy trading week  ", "AUDUSD trades to new session highs. Re-tilted to more bullish, but....", "Major stock indices are opening marginally lower", "The GBPUSD waffles back and forth near highs", "EURUSD stays within the narrow trading range.   ", "The NZD is the strongest and the JPY is the weakest as NA traders enter for the day", "Dollar keeps mostly little changed to start the session", "Cable nudges a tad lower as no white smoke from Brexit negotiations just yet", "Major indices close near session highs. Snap 2 day losing streak", "GBPUSD moves up to all swing area and underside of broken trend line", "AUDUSD recovering earlier declines", "US stocks turn positive as Covid stimulus talks give hope for a deal ", "USDCHF falls below 200/100 hour MA. Tests trend line", "EURUSD breaks to new day highs", "EURUSD retests 100 hour MA at 1.18519", "NZDUSD falls from near two year high"], "date": [1606141902.0, 1606140996.0, 1606138587.0, 1606131368.0, 1606123557.0, 1606119876.0, 1605962814.0, 1605891987.0, 1605887972.0, 1605887086.0, 1605884555.0, 1605882725.0, 1605881878.0, 1605880366.0, 1605877831.0, 1605862388.0, 1605860190.0, 1605820136.0, 1605819800.0, 1605818937.0, 1605815401.0, 1605814228.0, 1605813247.0, 1605808392.0, 1605803229.0]},
{"headline": ["USDJPY moves back toward unchanged level after modest corrective move", "USDCAD returns beach to between the 100/200 hour MA", "Stocks down for the 3rd day at the opening", "GBPUSD lower but has to get below the 200 hour MA", "EURUSD stays on the low side of the 100 hour MA. The range for the week is only 80 pips so far (very low).", "Gold is threatening the bottom of the range since Sept as prices fall 1%", "The USD is the strongest and the AUD is the weakest as NA trading begins", "Dollar continues to keep firmer as risk remains more defensive on the session", "Dollar pushes higher as risk turns more defensive to start European trading", "AUD/USD falls to session lows as dollar holds firmer to start European morning trade", "GBP/USD runs into a bit of a double-top but buyers still keep near-term control for now", "EUR/USD goes back to the drawing board as buyers fail to really challenge 1.1900 this week", "Major indices tumble lower into the close. Indices close at session lows.", "US stocks weakening into the close. Dow down 300 points", "WTI crude oil futures settle at $41.82", "NZDUSD trades to the highest level since December 2018 ", "Dow, S&P turn negative. NASDAQ maintains a modest gain", "AUDJPY traders have a decision to make", "USDCAD trades at the lowest level since November 11", "Maj. European indices end the session with gains across the board", "USDJPY falls below a lower trendline and trades to new session lows", "GBPUSD wanders back higher", "US major indices open up with mixed results", "USDJPY lower on the day. Below the 61.8% retracement", "US stocks set to open mixed"], "date": [1605802133.0, 1605799506.0, 1605796392.0, 1605795877.0, 1605794418.0, 1605793405.0, 1605791753.0, 1605782465.0, 1605776283.0, 1605774168.0, 1605771692.0, 1605770555.0, 1605733413.0, 1605732958.0, 1605728346.0, 1605728029.0, 1605724865.0, 1605723063.0, 1605719902.0, 1605717734.0, 1605714395.0, 1605710983.0, 1605709976.0, 1605709903.0, 1605709094.0]},
{"headline": ["EURUSD retraces to the day lows. Cracks below trend line support on hourly", "The NZD is the strongest and the USD is the weakest as NA traders enter for the day", "GBP/CHF could easily rally to between 1.30 and 1.40 over the next 12 months - UBS", "Dollar being stretched to key technical levels on the session", "Dollar eases to the lows for the day to start the session", "USD/JPY eases just below 104.00 as risk tilts more defensively ahead of European trading", "Russell 2000 closes at record for the 3rd consecutive day", "EURJPY slides lower and below 200 hour MA", "European major indices close mixed on the day", "USDCAD traders define the range", "USDCHF bounces.  Tests Asian-Pacific swing low after bouncing near 50% midpoint", "AUDUSD rotates lower after testing high from last week", "Stocks open with declines across the board", "GBPUSD runs higher, but stalling ahead of topside resistance", "EURUSD moves to new highs as dollar retreats (sans the commodity currencies)", "USDJPY falls to new session lows after retail sales report", "The GBP is the strongest and the NZD is the weakest as NA trader enter for the day", "EUR/USD inches closer towards 1.1900 as dollar keeps softer on the session", "Dollar keeps slightly softer on the session but key technical levels still holding up", "USD/JPY eases to fresh one-week low as sellers keep near-term control", "Dollar holds its ground as major currencies observe little change to start the session", "Dow and S&P close at record levels", "CFTC commitments of traders: EUR net speculative position remains the largest of the majors", "US crude oil futures settle at $41.34", "EURJPY trades around MAs"], "date": [1605708056.0, 1605705880.0, 1605693559.0, 1605688055.0, 1605684847.0, 1605678341.0, 1605647627.0, 1605646921.0, 1605631508.0, 1605630926.0, 1605627989.0, 1605626462.0, 1605623525.0, 1605623364.0, 1605621800.0, 1605620680.0, 1605618743.0, 1605612920.0, 1605606887.0, 1605602957.0, 1605601569.0, 1605560801.0, 1605559020.0, 1605556181.0, 1605548294.0]},
{"headline": ["Major European indices close higher", "AUDUSD breaks to new highs into the London fixing", "USDCAD consolidates around 100 and 200 hour MAs", "GBPUSD trades between 100/200 hour MA", "USDJPY falls below swing area and 200 hour MA", "US major indices open mixed led by the Dow industrial average. NASDAQ lacks", "EURUSD looks toward the converged 100/200 hour MA", "USDJPY runs up to test the 100 hour MA and stalls", "The CAD is the strongest and the JPY is the weakest as NA traders enter for the day", "Pound gains pared back as buyers lose some momentum from earlier today", "Dollar eases lower as the session gets underway", "EUR/USD slightly higher as dollar holds mildly weaker to start the session", "USDCAD steps back higher and tests the earlier high for the day", "European shares end the week with a positive day", "AUDUSD sellers had their shot?  Stays above 200 hour MA/swing area", "GBPUSD trades between the 100 and 200 hour MA", "EURUSD holding above the 100 hour moving average and up and down trading", "Major US indices indices open higher across the board", "USDJPY falls to new lows and looks toward 200 hour MA", "Dollar holds mildly weaker ahead of North American trading", "GBP/USD a little higher so far on the day but still playing within the near-term range", "One for the tech analysis folks - Australian journalists discover the magic of the 14-day moving average ", "US stocks close lower.   Dow and S&P close down 1% ", "NZDUSD fall below 100 hour MA and trend line as stocks weaken", "GBPUSD reaches 200 hour MA target"], "date": [1605545457.0, 1605543042.0, 1605541025.0, 1605539352.0, 1605538706.0, 1605537166.0, 1605536316.0, 1605533934.0, 1605532104.0, 1605518367.0, 1605514538.0, 1605512776.0, 1605286295.0, 1605285735.0, 1605282702.0, 1605281258.0, 1605279270.0, 1605277934.0, 1605276751.0, 1605267337.0, 1605257309.0, 1605220330.0, 1605215176.0, 1605212877.0, 1605205288.0]},
{"headline": ["The ECB Forum is over. What did the markets do?\n", "US stocks extend declines. Trade to new session lows", "European shares break 3-day win streak", "AUDUSD continues to waffle but below the 100 hour MA", "USDCAD breaks higher.  Moves above 200 hour MA and runs.", "USDJPY trades to new session lows, but cant keep the momentum going. ", "Major US indices opened mixed", "GBPUSD down for the 2nd consecutive day", "EURUSD trades between 100 hour MA above and 200 hour MA/50% below", "The CHF is the strongest and the GBP is the weakest as NA traders enter for the day", "Cable eases to session lows ahead of North American trading", "Major currencies trade little changed so far, equities slightly lower on the session", "Dollar slightly firmer as we get into European morning trade", "NASDAQ index rebounds 2% and closes near the highs", "AUDUSD tries to keep a lid at the 100 hour MA", "WTI crude oil futures for December settled $0.09 higher at $41.45", "USDCAD wanders higher", "EURGBP trades between key support and key resistance", "EURUSDs fall below the 200 hour/50% is failing", "NASDAQ index up over 200 points or 1.85%", "European major indices close higher for the 3rd consecutive day", "USDJPY trades to a new week high", "GBPUSD falls to new day lows and looks toward 100 hour MA", "Major US indices open with gains. NASDAQ looking to break its 2-day slide", "US stocks set to open higher"], "date": [1605203939.0, 1605203358.0, 1605199319.0, 1605196053.0, 1605194107.0, 1605192949.0, 1605191739.0, 1605190694.0, 1605189100.0, 1605186629.0, 1605184426.0, 1605177179.0, 1605163515.0, 1605128968.0, 1605128351.0, 1605124055.0, 1605123075.0, 1605118493.0, 1605116563.0, 1605114596.0, 1605112916.0, 1605108442.0, 1605106878.0, 1605105081.0, 1605104580.0]},
{"headline": ["USDCHF tests 100 day MA and backs off", "EURUSD lower but runs into 200 hour MA/50% retracement", "The NZD is the strongest and the EUR is the weakest as NA session begins", "EUR/USD falls to fresh lows on the day as sellers try to seize near-term control", "Pound slips as Brexit deal \"deadline\" continues to shift ahead of transition period end", "EUR/GBP slips back below 0.8900, September lows in sight", "NZD/USD eyes break of 200-week moving average as RBNZ negative rates bets scale back", "Rotation out of NASDAQ into Dow for the 2nd consecutive day", "WTI crude oil futures settle at $41.36", "Fed's Daly: Sees moderate, gradual recovery going forward", "USDCAD moves back to the downside.   Trades above and below unchanged", "European shares end the session with gains", "AUDUSD looks to test the 100 hour MA", "GBPUSD tests swing area. Trades at highest level since September 4", "JOLTS job openings for September 6436 vs. 6500 estimate", "NASDAQ shares continue its decline", "US stocks opened mixed. NASDAQ and S&P lower. Dow higher", "US stocks set to open mixed", "USDJPY moves toward overhead resistance targets him", "EURUSD moves lower and remains in up and down trading range", "The GBP is the strongest and the CHF is the weakest as NA trader enter for the day", "EUR/USD falls to session low as sellers wrestle back some near-term control", "USD/JPY pares early losses, trades towards the highs for the day", "EUR/USD keeps a little higher as buyers retain near-term bias after failure to firmly break 1.1900", "Cable climbs to fresh two-month high above 1.3200"], "date": [1605103656.0, 1605101977.0, 1605101087.0, 1605097334.0, 1605088557.0, 1605083252.0, 1605080556.0, 1605042173.0, 1605036986.0, 1605033891.0, 1605031312.0, 1605026447.0, 1605022393.0, 1605021264.0, 1605020453.0, 1605019551.0, 1605018804.0, 1605018458.0, 1605017935.0, 1605016801.0, 1605013751.0, 1605005896.0, 1605004194.0, 1605001430.0, 1604997514.0]},
{"headline": ["Nomura recommends going long AUD/JPY on better risk backdrop, RBA downside factored in", "NASDAQ tumbles into the close. Dow and S&P close higher but near session lows", "NASDAQ shares turn negative after run to new record highs fails", "USDCHF stalling in swing area, but above 200 hour MA", "WTI crude oil futures settle at $40.29", "The 100 hour MA catching up to the EURUSD", "AUDUSD completes (well almost) the price lap up and down", "European shares end sharply higher.  Up 5 of the last 6 trading days", "Gold falls near $100 on the day", "EURUSD trades to a new session low", "USD/JPY extends gains. Nears election night high and 55-dma", "Major stock indices open up sharply higher with the Dow industrial leading the way", "USDCAD trades at lowest level since October 2018", "GBPUSD moves into a swing area on the daily chart", "USDJPY soars on \"risk on\" flows", "The AUD is the strongest and the JPY is the weakest as NA traders enter for the day", "USD/JPY climbs by over 1% as risk rally sinks the yen", "Dollar buyers show some poise in European morning trade", "Dollar stays pressured to start the session", "Stocks closed little changed. Stocks enjoy the best week since April", "USDMXN trades to new session lows after up and back down run", "WTI Crude oil futures settle at $37.14", "NASDAQ index turns back positive for the day", "GBPUSD tests the high from October", "European shares snap a 4-day win streak"], "date": [1604994800.0, 1604956284.0, 1604954298.0, 1604953763.0, 1604950740.0, 1604949031.0, 1604943841.0, 1604940247.0, 1604939322.0, 1604935635.0, 1604933883.0, 1604932545.0, 1604932247.0, 1604931374.0, 1604929135.0, 1604927489.0, 1604924557.0, 1604912217.0, 1604908513.0, 1604696757.0, 1604694151.0, 1604691479.0, 1604686201.0, 1604683133.0, 1604681416.0]},
{"headline": ["USDCAD trades to new week lows", "AUDUSD trades up and down.  Dip to new lows finds buyers", "Markets opened marginally lower but off overnight session lows", "USDJPY gets close to its next target level", "EURUSD trades to the highest level since mid-September", "The CHF is the strongest and the AUD is the weakest as the NA session begins", "EUR/USD keeps higher as the dollar trades more mixed so far on the session", "GBP/USD pares slight drop earlier, little changed on the session now", "Dollar holds steadier, equity futures keep lower to start the session", "Stocks up for the 4th straight day. NASDAQ gains 2.5%", "USDJPY falls to a new session low. Pair is down close to 1%", "Stocks pushing toward session highs", "More intraday EURUSD", "European shares close higher for the 4th consecutive day", "GBPUSD trades to a new high but backs off a bit", "Intraday support for the EURUSD is being tested", "USDCAD trades to a new low.  Trades into a swing arear from end Aug/early Sept", "US stocks open higher and look to add on to the 3 day win streak", "USDJPY running further to the downside", "EURUSD races higher with the dollar selling (and technicals of course)", "The EUR is the strongest while the USD is the weakest as NA traders enter for the day", "Dollar extends decline on the session, erases gains from early election night", "Gold trades to a fresh two-week high on dollar weakness", "Dollar a touch softer to start the session but there are still question marks abound", "Cable surges higher after BOE decision, helped by some dollar weakness"], "date": [1604679703.0, 1604675499.0, 1604673172.0, 1604672817.0, 1604671517.0, 1604668478.0, 1604656448.0, 1604652403.0, 1604648119.0, 1604610760.0, 1604606444.0, 1604605838.0, 1604604690.0, 1604594252.0, 1604593634.0, 1604590754.0, 1604588827.0, 1604587034.0, 1604586083.0, 1604585012.0, 1604582359.0, 1604570278.0, 1604568185.0, 1604563386.0, 1604561717.0]},
{"headline": ["Major indices up for the 3rd straight day. Rise despite election uncertainty ", "Crude oil futures settles at $39.15", "USDCAD scraping along bottoms", "It's been quiet a ride in Chinese yuan trading", "USDJPY tests hour MAs and finds sellers on the look", "EURUSD tests 200 hour MA, finds sellers on the test", "European shares rise for the 3rd consecutive day", "USDCHF trades above and below its 200 hour MA/50% retracement", "Gold trades above and below unchanged in the NA session so far", "AUDUSD above 100 day MA tilts the bias higher.", "US major indices open higher led by the NASDAQ index", "The GBPUSD price action moving between hourly moving hours in volatile trading", "EURUSD tests the 50%/200 hour MA and backs off. The 100 hour and 100 day MA is support below. ", "The CHF is the strongest and the GBP is the weakest as NA traders enter for the day", "Gold climbs back above $1,900 as dollar pares gains", "Dollar holds firmer ahead of European morning trade", "USDCAD finds sellers near the 100 hour MA", "USD is racing higher.  AUD getting smashed", "Dollar extends run higher", "GBPUSD runs back to test its 200 hour MA and sees a bounce", "Dollar swings around  as early numbers come in", "Gold rebounds back above 100 day MA.  Buyers back in control before election results", "WTI crude oil futures settle at $37.66", "USDCAD snaps higher after the pair stalls ahead of recent swing low", "The USDCHF follows the USDs trend lower.  Runs into 50% retracement "], "date": [1604524375.0, 1604520607.0, 1604516435.0, 1604516076.0, 1604511580.0, 1604510338.0, 1604508756.0, 1604507346.0, 1604505130.0, 1604503217.0, 1604500347.0, 1604500155.0, 1604498502.0, 1604495588.0, 1604492819.0, 1604472050.0, 1604462756.0, 1604458621.0, 1604457522.0, 1604455793.0, 1604450102.0, 1604446661.0, 1604432240.0, 1604430009.0, 1604425924.0]},
{"headline": ["European shares enjoy their 2nd consecutive up day", "EURUSD gets closer to the 200 hour MA/50% retracement target", "AUDUSD gets on a boost on risk on flows.  ", "Major stock indices rise 2%. US dollar moving lower", "USDJPY trades up and down in choppy pre-election trading", "US stock indices open higher. Dow leads the way for the 2nd consecutive day", "GBPUSD peeks above 200 hour MA, and just below 50% retracement", "EURUSD positions itself between the 100/200 hour MA. Back above the 100 day MA.", "The AUD is the strongest and the USD is the weakest as NA traders enter for the day", "Dollar extends decline as stocks push higher on the session", "Oil continues impressive bounce after overnight rebound", "EUR/USD tests key near-term level as the dollar slips", "Dow industrial average leads the way to the upside", "AUDUSD higher on the day but stalls ahead of resistance targets", "European shares rebound after last week's collapse", "GBPUSD dips below 100 day MA today but momentum can't be sustained  ", "USDCAD back below 100 hour MA. Trades at new session lows", "Major indices rebound from Friday's sharp declines", "EURUSD traders set the support and resistance. Waiting for the shove.", "USDJPY retests 200 hour MA after run higher retraces", "The NZD is the strongest and the CHF is the weakest as NA traders enter for the day", "The NZD is the strongest and the CHF is the weakest as NA traders enter for the day", "Cable tests 100-day moving average as pound stays pressured to start the session", "Dollar holds steadier to start the new week", "The major indices close lower but rebound into the close eases the pain"], "date": [1604421728.0, 1604421244.0, 1604420113.0, 1604417559.0, 1604416451.0, 1604414203.0, 1604413996.0, 1604411522.0, 1604409557.0, 1604398047.0, 1604394185.0, 1604392244.0, 1604350997.0, 1604336787.0, 1604335145.0, 1604333028.0, 1604330902.0, 1604327583.0, 1604327213.0, 1604325553.0, 1604323233.0, 1604323048.0, 1604306392.0, 1604302675.0, 1604089045.0]},
{"headline": ["US 10-year yields rise to the highest since June", "Crude oil futures settle at $35.79", "NZDUSD retesting 100 day MA again", "Mixed result in for European stock indices to end the week", "EURUSD cracks the 100 day MA", "AUDUSD works on the next lap. This one to the downside", "USDJPY tests the 200 hour MA and backs off", "US yields are not buying the flight to safety storyline", "USDCAD trades below 100 day MA but support floor established", "Nasdaq runs lower.  Tests lows from yesterday's trading", "US indices open lower but off overnight low levels", "The GBPUSD finds upside resistance. What next?", "EURUSD recovers higher toward swing area (breaks above now)", "The GBP is the strongest and the CHF is the weakest as NA traders enter for the day", "Major currencies mostly little changed so far", "AUD/USD nears 0.7000 once again to start the session", "USDCAD can't stay above 100 day MA", "Crude oil futures close lower but bounces off 50% retracement support ", "USDJPY keeps the upside snap back going", "German DAX snaps 3 day slide with a modest gain", "AUDUSD looks to test the September low. Key level.", "EURUSD moves to new lows and in the process moves toward 100 day MA", "USDCHF trades to new session highs and tests mid-October ceiling", "S&P index moves back up toward a retest of the broken 100 day moving average.  Dow and Nasdaq higher as well.", "USDCAD extend above its 100 day moving average for the 1st time since June 1, 2020"], "date": [1604085733.0, 1604083338.0, 1604082933.0, 1604076354.0, 1604074921.0, 1604073411.0, 1604070591.0, 1604069740.0, 1604067532.0, 1604066366.0, 1604065087.0, 1604064547.0, 1604062674.0, 1604060482.0, 1604046439.0, 1604042909.0, 1604001387.0, 1603996658.0, 1603995674.0, 1603989480.0, 1603986927.0, 1603986056.0, 1603984596.0, 1603982196.0, 1603980944.0]},
{"headline": ["WTI crude oil futures dropped below $35. Down over 6% on the day", "US indices open up with mixed results. The Dow lags. The NASDAQ leads.", "GBPUSD respects overhead resistance and stays within the wide bands", "USDJPY snaps back higher helped by GDP", "EURUSD trades a little higher after rate decision", "The JPY is the strongest and the EUR is the weakest as NA traders enter for the day", "Oil falls to fresh four-month low amid renewed supply concerns", "Cable lingers near 1.3000 with sellers still in near-term control amid election, Brexit focus", "Dollar pares slight losses to start the session", "Major indices plunge on Covid/election fear. Close near session lows", "The AUDJPY is the biggest mover today. What does the chart say?", "WTI crude oil futures for December delivery settles at $37.39", "AUDUSD trends to the downside, but finds a consolidation area", "Gold cracks below its 100 day moving average", "The Vix index trades at highest level since mid June", "German DAX falls over 4.4% and leads the spiral in the European indices", "EURCHF stumbles lower to 200 day MA and finds buyers", "USDCAD tests and backs off from the 100 day MA", "Crude oil futures move toward the September/October lows", "Another leg down in stocks. Major indices down 3%.", "GBPUSD spikes higher on hopeful Brexit discussion headlines", "USDJPY bounces between July and September lows.  Can the price stay above?", "S&P index moves closer to 100 day moving average", "USDCAD trades higher into rate decision", "Stocks tumble at the open. Dow down for 3rd day in a row"], "date": [1603978927.0, 1603978742.0, 1603978432.0, 1603977179.0, 1603976406.0, 1603974140.0, 1603968124.0, 1603963866.0, 1603960075.0, 1603915560.0, 1603913781.0, 1603910332.0, 1603909045.0, 1603906956.0, 1603905638.0, 1603903132.0, 1603900993.0, 1603898566.0, 1603898048.0, 1603897017.0, 1603895510.0, 1603894616.0, 1603893925.0, 1603893346.0, 1603891879.0]},
{"headline": ["EURUSD tumbles as fears increase", "Risk off.  JPY and USD are the strongest and AUD and NZD are the weakest ", "EUR/JPY flirts with three-month lows amid the risk-off tone in the market today", "EUR/USD trades to session lows, 1.1700 back in focus", "Dollar firms as risk aversion deepens on the session", "Cable tests 1.3000 again as dollar firms as stocks slump", "EUR/USD lower to start the day as euro weighed down by fears of tighter virus restrictions", "NASDAQ close higher, but S&P and Dow close near session lows and negative on the day. MSFT earnings beat est.", "US crude oil futures settle at $39.57", "USDCHF completes up and down lap, but stalls at 100 hour MA. Will the selling continue or will support hold?", "NZDUSD trades to the highest level since September 21", "The AUDUSD trades in a confined range", "USDCAD corrects today, but MA holds support", "US stocks marginally higher in early US trading", "USDJPY trades to a new session low", "GBPUSD continues to have trouble breaking and stay below its 200 hour MA", "EURUSD trades between 100 and 200 hour moving averages", "The NZD is the strongest and the CHF is the weakest as NA traders enter for the day", "Dollar pares slight losses as the session gets underway", "Dollar keeps slightly softer ahead of European morning trade", "A technical look at the major indices", "Major indices close lower but off there lowest levels", "WTI crude oil futures (December delivery) settles at $38.56. Price is moving away from the 100/200 day MAs", "Gold not participating in the market volatility today", "NASDAQ index falls below 200 hour MA"], "date": [1603889698.0, 1603887890.0, 1603881615.0, 1603878479.0, 1603874761.0, 1603874163.0, 1603859311.0, 1603829151.0, 1603825416.0, 1603822893.0, 1603814600.0, 1603811174.0, 1603809030.0, 1603805918.0, 1603805748.0, 1603804470.0, 1603803121.0, 1603801197.0, 1603786845.0, 1603781088.0, 1603744074.0, 1603742703.0, 1603740155.0, 1603736987.0, 1603733577.0]},
{"headline": ["Major European indices close down sharply led by German Dax", "USDCAD rallies with oil falling and USD safety buying", "The USD rises as risk off pushes the greenback higher", "S&P, Dow trading to new session lows", "USDJPY above 100 hour MA.  Trades between 100 and 200 hour MAs", "GBPUSD trades up and down.  200 hour MA eyed ", "US stocks open the week with sharp declines", "EURUSD on a down day as concerns on Covid hit the currency", "The GBP is the strongest and the CAD is the weakest as NA traders enter for the day", "Cable bounces as price action ping pongs between key near-term levels", "Dollar keeps firmer to start the session amid risk-off vibes in the market", "It was a strong week for the kiwi", "EUR/USD extends gains as the dollar keeps softer on the session", "Dollar loses some ground as stocks nudge higher", "Euro gets a slight lift to start the session on German manufacturing PMI data beat", "US S&P futures turn positive", "USDJPY technicals keep the sellers more in control", "The Presidential debate begins.  ", "USD moves higher ahead of the Presidential election debate. Watch LIVE here.", "GBPUSD retraces back to 50% midpoint area. Moves below now.", "EURUSD falls to new session lows.  Cracks the 100 hour MA and 38.2% retracement", "Japans Nikkei futures up 0.3% in early trade", "AUDUSD extends higher after solid PMI data", "US e-mini stock futures open higher by about 5 points.", "The EURUSD is ending near session lows"], "date": [1603730369.0, 1603728668.0, 1603724985.0, 1603723013.0, 1603721759.0, 1603720462.0, 1603719116.0, 1603718805.0, 1603715004.0, 1603706723.0, 1603702183.0, 1603474868.0, 1603446945.0, 1603440849.0, 1603439231.0, 1603423311.0, 1603423039.0, 1603415608.0, 1603414035.0, 1603412500.0, 1603411962.0, 1603410713.0, 1603406441.0, 1603404782.0, 1603400910.0]},
{"headline": ["Major indices close higher for the 2nd time in 3 days", "Cable eases to 1.3100 as the dollar keeps steadier so far on the session", "AUD/USD caught in a near-term battle to start the day, what levels to look out for?", "Dollar holds steadier to start the session", "AUDUSD is the biggest mover in the Asian session", "Dollar higher, stocks lower and gold heading lower", "USDCAD runs into overhead targets. Key area for buyers and sellers. ", "NZDUSD moves lower and toward the 200 hour MA/38.2% retracement", "FBI: Russia, Iran have attempted to interfere with US election", "The EURUSD rose for the 4th consecutive day yesterday", "Major US indices close lower on the day and near the lows of the day", "USD/JPY drops to a fresh one-month low, strays away from the typical yields correlation", "Cable climbs to fresh one-week high as EU reaffirms commitment to reach Brexit compromise", "AUD/USD gains on a softer dollar but can buyers keep the momentum going?", "Cable tests the 1.3000 level again amid dollar weakness, Brexit standoff", "EUR/USD trades at one-month high as dollar keeps weaker to start the session", "US major indices break losing streaks but close well off the highs ", "GBPUSD happy to chop", "US crude oil futures settle at $41.46", "USDJPY erases gains for the day", "WTI crude climbs to six-week high", "NZDUSD fights way back above broken 100 day MA", "Stocks trade to new session highs", "USDCAD runs lower.  Looks toward October lows", "European shares end the session with mixed results"], "date": [1603396984.0, 1603358518.0, 1603351168.0, 1603348301.0, 1603338635.0, 1603331785.0, 1603329975.0, 1603327400.0, 1603323725.0, 1603322343.0, 1603310754.0, 1603269659.0, 1603267183.0, 1603265437.0, 1603263202.0, 1603262315.0, 1603224319.0, 1603221192.0, 1603218861.0, 1603218253.0, 1603217929.0, 1603216799.0, 1603211972.0, 1603210234.0, 1603208068.0]},
{"headline": ["USDCHF falls to the high of swing lows from September and bounces", "EURUSD trades to a new month high", "AUDUSD waffles near lows for the day", "US stocks open higher. NASDAQ up for the 1st time in 6 trading days", "USDJPY breaks out of the Monday blues today", "EURUSD higher but stalling ahead of the October highs", "The EUR is the strongest and the NZD is the weakest as NA traders enter for the day", "Dollar keeps more mixed so far on the session", "Cable continues choppy journey for the past week, what levels to be aware of?", "Gold stays poised for a breakout, will the end of stimulus talks be the trigger?", "AUD/USD sees 0.7000 in focus as aussie weighed lower by RBA Kent's remarks", "NASDAQ index lower for the 5th straight day. The Dow and S&P down for the 4th day in 5 days", "EURUSD retraces toward the 50% retracement/200 hour moving average ", "AUD/USD nears recent lows as mood continues to sour", "Major indices down over 1.25% on the day", "WTI crude oil futures settle at $40.83 for the November contract", "USDJPY didn't come to play today.  Barely moving today.", "NZDUSD tries to hang above the 100/200 hour MA", "Major European indices end with mixed results to start the trading week", "Major US indices give up their gains", "USDCAD back below MAs on hourly but runs into consolidation support ", "USDCHF extends to new lows. Eyes lows from last week.", "Major US stock indices open higher with the NASDAQ leading the charge", "GBPUSD continues ups and downs. Today back higher.", "EURUSD starts the week with a race back higher"], "date": [1603207291.0, 1603203881.0, 1603202933.0, 1603200890.0, 1603200302.0, 1603198867.0, 1603196332.0, 1603185275.0, 1603179906.0, 1603176928.0, 1603175717.0, 1603137945.0, 1603134549.0, 1603134227.0, 1603133264.0, 1603132420.0, 1603131994.0, 1603123639.0, 1603121784.0, 1603119674.0, 1603118913.0, 1603117393.0, 1603114666.0, 1603114361.0, 1603112671.0]},
{"headline": ["The GBP is the strongest and the USD is the weakest as NA traders enter for the day", "Dollar eases as risk keeps steadier on the session", "Cable nears 1.3000 as pound keeps firmer on the session", "EUR/USD continues to drift sideways as euro glow begins to fade in Q4", "Pound firms to start the session, runs into test of key near-term resistance region", "Sterling falls as UK PM Johnson responds by calling to prepare for no-deal Brexit", "Pound steadies on the session, Brexit still the main focus", "Sterling drifts ahead of key Brexit decision day for Boris Johnson", "Major indices close lower for the 3rd straight day", "Some technical levels to watch in the new trading day", "Major indices trim losses", "WTI crude oil futures settle at $40.96", "AUDUSD ticks back above the 100 day MA. Can it stay there?", "AUDUSD cracks below the 100 day MA for first time in 5 months", "NZDUSD tests 100 day MA. Stalls on first test.", "The USDCAD breaks and runs higher (finally)", "USDJPY chops below a topside trend line", "Major indices open lower across the board led by the NASDAQ index", "GBPUSD works on the down day as ups and downs continue", "EURUSD falls below 50%/swing area ", "The USD is the strongest and the AUD is the weakest as NA traders enter for the day", "Cable pretty much erases the bounce from yesterday, what to look out for next?", "Dollar extends gains as risk-off mood deepens in European morning trade", "AUD/USD slumps to fresh session low on softer risk mood, key support levels in focus", "Major indices close lower for the 2nd consecutive day"], "date": [1603109533.0, 1603100941.0, 1603096593.0, 1603095619.0, 1603091716.0, 1602847093.0, 1602836187.0, 1602826010.0, 1602792365.0, 1602791946.0, 1602789849.0, 1602787476.0, 1602786769.0, 1602778015.0, 1602774697.0, 1602773057.0, 1602770604.0, 1602768691.0, 1602768248.0, 1602766382.0, 1602764133.0, 1602761788.0, 1602751862.0, 1602746400.0, 1602705825.0]},
{"headline": ["Traders set the 200 hour MA as topside resistance for the EURUSD", "WTI crude oil futures settle at $41.04", "GBPUSD found sellers, but not until nearly completing the down and up lap", "AUDUSD pushes below trend line support", "Stocks move lower as hopes for stimulus fade", "European major indices end the session with mixed results", "The USDCHF falls below its 100 hour MA.  More bearish.", "USDJPY trades to new session low and eyes the 50% retracement target", "NASDAQ index turns negative", "USDCAD stays below 100 hour MA on first tests", "US equities open with gains. NASDAQ leads the way", "AUDUSD tests 100 hour MA as pair corrects some of the week's declines", "EURUSD follows the GBPUSD higher (at a slower pace).  Back toward hourly MAs", "GBPUSD back above 100 hour moving average and resistance area near the 1.3000 level", "The GBP is the strongest and the EUR is the weakest as NA traders enter for the day", "Sterling continues with the Brexit see-saw as UK reportedly won't walk away from talks immediately", "AUD/USD sellers in control to start the session, what to look out for in the day ahead?", "Pound keeps weaker to start the day, Brexit risks in focus", "Four day up streak is snapped in US equities", "USDCHF has trouble at 200 hour MA", "WTI crude oil futures settle at $40.20", "AUDUSD tests retracement/swing area", "GBPUSD falls below the 200 hour MA. The run lower continues.", "USDCAD stuck in a 47 pip range this week. Something has to give. ", "EURUSD extends lower and moves toward the swing low from last Thursday"], "date": [1602704455.0, 1602701383.0, 1602695170.0, 1602694020.0, 1602691923.0, 1602690177.0, 1602689944.0, 1602687213.0, 1602685739.0, 1602684777.0, 1602682762.0, 1602682653.0, 1602680504.0, 1602679123.0, 1602677944.0, 1602667128.0, 1602660933.0, 1602657187.0, 1602619583.0, 1602617702.0, 1602614916.0, 1602614432.0, 1602611830.0, 1602606532.0, 1602602653.0]},
{"headline": ["USDCHF moves back above it's 100 hour MA", "Gold falls on the dollars run higher", "USDJPY holds at old support area. Bounces today. ", "US stocks open mixed.  Nasdaq up. Dow lags.", "EURUSD consolidates above and below the 100 hour MA. Traders look for a break and run.", "GBPUSD moves to a new session low in up and down trading ", "The NZD is the strongest and the GBP is the weakest as NA traders enter for the day", "EUR/USD grapples with key near-term level to start the session", "Key FX options expires for Tuesday, October 13", "The AUDUSD falls and tests the 100/200 hour MAs", "US stocks end the session higher but come off the best levels of the day", "AUDUSD is trading above and below the swing highs from last two weeks", "EURJPY wanders toward 200 hour MA but bounces", "WTI crude oil settles at $39.43", "US stocks continue run higher", "GBPUSD moves higher as PM Johnson announces new coronavirus plan. BOE Haskel talks on negative rates", "The USDCHF tests Friday lows and swing area", "USDJPY moves toward swing area support", "US stocks open higher but off premarket highs", "EURUSD trades near midrange after corrective move lower stalls near support", "The JPY is the strongest and the AUD is the weakest as NA trader enter for the dya", "Dollar gains some modest ground on the session", "Currencies keep little changed to start the day", "GBP/USD in a good spot to start the new week but pound risks are aplenty", "Stocks close at the highest level since September 2. Dow closes positive for the year"], "date": [1602601121.0, 1602598630.0, 1602596571.0, 1602596000.0, 1602594859.0, 1602594108.0, 1602591588.0, 1602573701.0, 1602553175.0, 1602551056.0, 1602533403.0, 1602532038.0, 1602529323.0, 1602528131.0, 1602518055.0, 1602514432.0, 1602513390.0, 1602510470.0, 1602509663.0, 1602508785.0, 1602506606.0, 1602496480.0, 1602490784.0, 1602487962.0, 1602274243.0]},
{"headline": ["CFTC commitments of traders: EUR longs lowest since end of July", "USDCHF trends lower with the dollar's move", "GBPUSD extends toward a topside trendline ", "Crude oil futures settle at $40.63", "Silver rises by 5% on the day ", "NZDUSD runs higher and higher", "Dollar moves to new lows as stocks continue run higher on deal hopes", "European shares in the session mixed. Higher for the week", "GBPUSD trades toward the highs for the week", "NASDAQ index up over 100 points now", "USDJPY cracks the 100 hour MA and runs to the 200 hour MA", "US dollar is reaching new lows against all the major currencies", "Major indices open higher with the gains similar amongst the indices", "The USDJPY moves back to test key breakout levels", "EURUSD trades to highest level since September 21", "USDCAD moves to new session lows after stronger employment data", "The NZD is the strongest and the USD is the weakest as NA traders enter for the day", "Gold keeps 1% gains on the day but faces key resistance levels to end the week", "EUR/USD nears another test of 1.1800 as the dollar keeps weaker on the session", "The UK economic recovery looks to have peaked, but the pound has bigger issues to worry about", "Gold nears the downtrend from the record high, breaks $1900", "Major indices close higher for the 2nd straight day", "The USDJPY stays in narrow 17-18 pip trading range for the day", "WTI crude oil futures settle at $41.19", "EURUSD tests 100 hour MA after 200 hour moving average/38.2% held at the lows"], "date": [1602272646.0, 1602271820.0, 1602269758.0, 1602268777.0, 1602264056.0, 1602262306.0, 1602259745.0, 1602257996.0, 1602255441.0, 1602254771.0, 1602253592.0, 1602251171.0, 1602250498.0, 1602250045.0, 1602249151.0, 1602247670.0, 1602246089.0, 1602236578.0, 1602231162.0, 1602224965.0, 1602209840.0, 1602187793.0, 1602187254.0, 1602182293.0, 1602178276.0]},
{"headline": ["Gold trades at new session lows", "US treasury auctions off $23 billion of 30 year bonds at 1.578%", "NZDUSD back near unchanged in up and down session", "Choppy price action in the GBPUSD continues", "USDCHF tries to extend above 200 hour MA.   First run higher found sellers.", "Major indices open higher in the US. NASDAQ stocks lead the way", "EURUSD breaks lower and runs to the 200 hour MA/38.2%", "If you thought the EURUSD ranges was narrow. The USDJPY range is tiny.", "EURUSD trades in a modest/low 30 pip range", "The AUD is the strongest and the GBP is the weakest as NA traders enter for the day", "US 30-year yields are the pivot point", "Major indices close sharply higher. Dow has best day since July", "Dow Industrial average now up over 2%", "WTI crude oil futures are settling at $39.95", "NASDAQ index up over 200 points", "US treasury sells $35 billion of 10 year notes at a high yield of 0.765%", "NZDUSD trades up and down but remains below 200 hour MA", "GBPUSD retests 100 hour MA and backs off", "US stocks extend gains. S&P erases losses from yesterday", "AUDUSD moves into neutral zone. Traders await the next shove", "USDCAD trades back below its 100 hour moving average", "USDJPY backs away from trend line resistance", "US stocks rebound higher and erase some of the declines from yesterday's trade", "The AUD is the strongest and the JPY is the weakest as NA traders enter for the day", "Cable bounces around key near-term levels so far on the day, what to look out for?"], "date": [1602176858.0, 1602176532.0, 1602169460.0, 1602168036.0, 1602165643.0, 1602164034.0, 1602163838.0, 1602162854.0, 1602161495.0, 1602159148.0, 1602121729.0, 1602101310.0, 1602095846.0, 1602095683.0, 1602092770.0, 1602090129.0, 1602089976.0, 1602087712.0, 1602083653.0, 1602083040.0, 1602081826.0, 1602079212.0, 1602077515.0, 1602072903.0, 1602064475.0]},
{"headline": ["USD/JPY hits fresh three-week high, closes in on 106.00", "Gold buyers wrestle back some near-term control, eyes on the $1,900 level", "Dollar eases to start the session as the risk mood keeps calmer for now", "Gold now faces another test of the key $1850 zone", "US stocks end sharply lower", "USD head higher as flight to safety flows dominate ", "WTI crude oil futures settle at $40.67", "Politico:Trump had call with GOP leaders on Covid relief", "NZDUSD trades to a NY session low.  Back below 100 hour MA", "USDCAD trades to new session highs and extends the narrow trading range", "AUDUSD trades down day but off session lows", "Nasdaq erases declines ", "USDJPY bounces off 100/200 hour MA at low and ceiling area at highs", "Major indices are trading mixed as buyers and sellers battle it out", "EURUSD trades above and below 200 bar MA on 4-hour chart", "GBPUSD moves up to swing high target and backs off today. 100 hour MA is support.", "The CHF is the strongest and the AUD is the weakest as NA trader enter for the day", "Major US stock indices close near highs for the day", "The bond market is signaling that another round of US stimulus is coming", "EURJPY runs to 200 bar MA on 4-hour/50% retracement", "EURUSD backtracks toward swing area on the hourly chart", "NASDAQ index now up over 200 points. S&P index looks toward the 3400 level", "AUDUSD test 100 bar MA on 4-hour chart and backs off", "European shares end the session higher", "USDCAD tests 38.2% retracement of move up from September low"], "date": [1602056551.0, 1602056129.0, 1602055097.0, 1602018548.0, 1602015376.0, 1602010988.0, 1602009990.0, 1602006850.0, 1602005571.0, 1602000219.0, 1601995055.0, 1601993836.0, 1601992774.0, 1601991548.0, 1601991349.0, 1601989933.0, 1601986842.0, 1601928381.0, 1601927193.0, 1601925521.0, 1601921778.0, 1601915442.0, 1601915079.0, 1601912467.0, 1601910699.0]},
{"headline": ["Stocks continued move higher on better data. ", "USDJPY holds above 100 hour moving average", "USDCHF tests the 50% is of the range since September 1", "US stocks open higher after last week's gains", "GBPUSD trades to highest level since September 18", "EURUSD trades to last week highs and backs off", "The CHF is the strongest and the JPY is the weakest as NA traders enter for the day", "USD/JPY pares the drop from Friday, what's next?", "Major currencies not doing a whole lot to start the day", "Major indices close lower as the market digests Pres. Trump's Covid diagnosis and no new stimulus deal", "CFTC commitments of traders: Traders reverse speculative positions in GBP to a modest short.", "EURUSD higher on the week. Moves back above swing area", "WTI crude oil futures settle at $37.05", "European shares and mixed and well off the lows for the day", "USDJPY rallies up to the 200 hour MA. Sellers lean.", "AUDUSD stays above 100 hour MA on dips today", "GBPUSD is higher (helped by Brexit hopes), but anything is possible", "US stocks open lower but off premarket implied levels", "USDJPY trades within a swing area (still mostly lower)", "EURUSD defines the range. Moves a little lower after the jobs report.", "The JPY is the strongest and the AUD is the weakest as NA traders enter for the day", "Pound catches a bid as UK PM Johnson intervenes on Brexit matters", "Oil falls to fresh two-week low, down by over 3% on risk-off sentiment", "USD/JPY closes in on 105.00 as risk aversion grips", "Dollar extends gains, stocks slide as Trump tests positive for COVID-19"], "date": [1601908405.0, 1601907951.0, 1601905653.0, 1601904644.0, 1601904100.0, 1601902862.0, 1601901162.0, 1601888105.0, 1601885853.0, 1601668919.0, 1601667463.0, 1601666906.0, 1601664127.0, 1601653112.0, 1601650809.0, 1601649608.0, 1601646304.0, 1601645548.0, 1601644072.0, 1601643040.0, 1601640727.0, 1601624350.0, 1601618547.0, 1601617852.0, 1601615750.0]},
{"headline": ["Stocks close with their 5th positive close in the last 6 trading days", "Gold rebounds today to the midpoint of the last move lower", "Crude oil futures settle at $38.72", "Most pairs remain contained in trading today", "European shares close mostly higher", "AUDUSD chops higher but stalls at topside trend line", "The NZDUSD higher on the day but stalls near the 50% retracement level", "USDCHF fall below support failed as dollar rebounds off lows", "US stocks open higher on hope for a stimulus deal", "For the GBPUSD it ain't easy as headline volatility in play", "USDJPY trades near session highs in a narrow trading range", "EURUSD trades to a 7-day high. Tests 50% retracement/swing area", "The AUD is the strongest and the USD is the weakest as NA traders enter for the day", "Pound erases losses for the day on chatter of possible Brexit compromise", "Pound falls further as Brexit worries continue to mount", "Pound gets a bit of a knock on negative Brexit headlines", "Dollar keeps a little softer to start the session", "Major US indices close higher but well off their highs for the day", "Dollar moves off lows as earlier trends reverse", "Gains melting away in US equities", "Crude oil futures settle at $40.22", "USDCAD falls to 38.2% retracement", "European indices close with mixed results", "AUDUSD moves toward 50% retracement", "USDCHF falls to new week lows."], "date": [1601583127.0, 1601581903.0, 1601578223.0, 1601573005.0, 1601566959.0, 1601566588.0, 1601564301.0, 1601562707.0, 1601559378.0, 1601559105.0, 1601557909.0, 1601557066.0, 1601554707.0, 1601551785.0, 1601541522.0, 1601540273.0, 1601537231.0, 1601497418.0, 1601494223.0, 1601492153.0, 1601490981.0, 1601489842.0, 1601480580.0, 1601479694.0, 1601477727.0]},
{"headline": ["GBPUSD spiking to new highs and looks to test the high price from yesterday ", "Major US indices push higher. NASDAQ index up over 100 points. Dow leads the way", "USDJPY pushes away from 100 hour MA (again) but there is a topside ceiling", "US major indices trade higher in early trading", "USDCAD trades to a new 2 month high but only barely", "EURUSD trades up to resistance and down to a swing support area.  ", "GBPUSD traders lean near the 200 hour MA/50% retracement", "The USD is the strongest and the CHF is the weakest as NA traders enter for the day", "EUR/USD inches back towards 1.1700 as sellers wrestle back some near-term control", "Cable buyers still clinging on to hope for now, Brexit showdown still the key risk", "USD/JPY lower to start the session on softer risk tilt", "US major indices end lower. Dow, S&P and NASDAQ snap 3 day winning streak", "Gold pushes toward $1900. ", "EURJPY runs higher in trading today", "The USDCHF traders did the right thing to keep the sellers in control ", "Crude oil futures settle down at $39.29", "NZDUSD wanders higher. Extends above 100 hour MA today ", "WTI crude oil falls extends to over $2 lower", "USDCAD moves toward highs from last week", "European shares end the session lower.", "USDJPY higher but choppy trading conditions continue", "EURUSD extend above targets", "USDCHF moves to a new day low and looks to test 200 hour MA", "US stocks little changed in early trading", "AUDUSD corrects to the 38.2% retracement"], "date": [1601475979.0, 1601475178.0, 1601474142.0, 1601473080.0, 1601472947.0, 1601471632.0, 1601470521.0, 1601468130.0, 1601457791.0, 1601455911.0, 1601447421.0, 1601410165.0, 1601409702.0, 1601407202.0, 1601405444.0, 1601404468.0, 1601403744.0, 1601396520.0, 1601395660.0, 1601394094.0, 1601392866.0, 1601390314.0, 1601389428.0, 1601386708.0, 1601386573.0]},
{"headline": ["EURUSD runs toward a resistance area...backs off on the first look", "GBPUSD waffles between retracement levels", "The AUD is the strongest and the JPY is the weakest as NA traders enter for the day", "Dollar eases a little on the session, what's the month-end play?", "Major currencies still in a bind to start the session", "US stocks close  higher led by the NASDAQ index", "NASDAQ index rises by 200 points and tests its 38.2% retracement", "WT high crude oil futures settle at $40.60", "NZDUSD waffles up and down in narrow trading range", "Dow ticks up over 2% on the day", "AUDUSD sees 100 hour MA fall toward consolidating market price", "USDCHF trades to a new day low and looks toward a test of its 100 hour moving average", "European indices closed sharply higher on the day", "GBPUSD falls back toward 50% and 200 hour MA", "USDCAD toys with its 100 hour MA in up and down session", "USDJPY lower on the day but holds 100 hour MA at the lows", "The week is off to a good start as major indices all sharply higher", "EURUSD trades above and below 100 hour MA.  Buyers making a play after the trend move lower last week.", "GBPUSD races higher. Can the gains be maintained?", "The GBP is the strongest and the USD is the weakest as NA traders enter for the day ", "Pound makes fresh highs for the day as Ramsden brushes aside negative rates talk", "Gold continues to stutter to start the new week, key support level in focus", "Pound keeps higher to start the week, Brexit the key risk factor to watch ", "US stocks close near high. Nasdaq has first up week in 4 weeks", "CFTC commitments of traders: The EUR longs increase and remains near records.  CAD the only shorts.  "], "date": [1601385145.0, 1601384106.0, 1601381977.0, 1601371929.0, 1601367766.0, 1601324034.0, 1601320987.0, 1601318186.0, 1601314829.0, 1601312483.0, 1601311479.0, 1601308174.0, 1601307245.0, 1601305078.0, 1601302016.0, 1601300730.0, 1601299991.0, 1601299078.0, 1601297647.0, 1601295676.0, 1601286264.0, 1601283973.0, 1601278838.0, 1601064309.0, 1601062718.0]},
{"headline": ["WTI crude oil futures settle at $40.25", "EURUSD has its largest week decline since March 2020", "Major indices extend to new session highs", "AUDUSD tests 100 day MA. New lows for the week.", "European shares close a ugly week week on a down note", "USDCAD looks toward the week's high", "GBPUSD trades to new session lows", "Australian dollar tags a new low but support is near", "USDCHF trades to a new day/week high", "US stocks are off and running and the indices are mixed", "USDJPY swings down and up between ....well swing areas", "EURUSD testing the low yesterday/for the week", "The NZD is the strongest while the EUR is the weakest as NA traders enter for the day", "NZD/USD extends modest rebound from overnight trading, what's next?", "Cable pushes to 1.2800 as buyers wrestle back some near-term control", "AUD/USD could correct further towards 0.6850 on RBA policy, US election - CBA", "Some technical levels to eye in the new trading day", "EURUSD looks to break 4 day losing streak today", "Crude oil futures settle at $40.31", "The USDCAD moves to new session lows", "Gold turns positive and trades to new session highs", "European shares close lower", "AUDUSD moves closer to the key 100 day MA", "Stocks found a catalyst after home sales.  Some risk on flows", "Broader indices turn positive"], "date": [1601059810.0, 1601059010.0, 1601056029.0, 1601049005.0, 1601048209.0, 1601047043.0, 1601044020.0, 1601043961.0, 1601042783.0, 1601040731.0, 1601039860.0, 1601038103.0, 1601036148.0, 1601019582.0, 1601018546.0, 1601015091.0, 1600977561.0, 1600973581.0, 1600972499.0, 1600965047.0, 1600963579.0, 1600961953.0, 1600959705.0, 1600956744.0, 1600955745.0]},
{"headline": ["USDJPY trades up and down in choppy trading today, but buyers hold support.", "US stocks open lower. NASDAQ leads the way to the downside again", "GBPUSD bases against 100/200 day MA today", "The EURUSD trading lower for the 5th day in a row", "The GBP is the strongest and the NZD is the weakest as NA traders enter for the day"], "date": [1600955404.0, 1600954301.0, 1600953443.0, 1600951710.0, 1600949513.0]}
]